package com.app.cbtrack

import java.text.SimpleDateFormat
import java.util.*

fun dateToString(date: Date) = SimpleDateFormat("dd.MM.yyyy", Locale.US).format(date)

val sad = arrayOf(
        "Грусть",
        "Печаль",
        "Грусть",
        "Разочарование",
        "Тоска",
        "Сочувствие",
        "Отчаяние",
        "Скорбь",
        "Сожаление",
        "Огорчение",
        "Жалость",
        "Горе")

val anger = arrayOf(
        "Злость",
        "Гнев",
        "Раздражение",
        "Возмущение",
        "Недовольство",
        "Отвращение",
        "Презрение",
        "Бешенство",
        "Обида",
        "Злость",
        "Досада",
        "Зависть",
        "Негодование",
        "Злорадство",
        "Неприязнь",
        "Ревность")

val scare = arrayOf(
        "Испуг",
        "Страх",
        "Беспокойство",
        "Тревога",
        "Ужас",
        "Паника",
        "Испуг",
        "Волнение",
        "Настороженность",
        "Боязнь",
        "Опасение",
        "Трепет")

val happy = arrayOf(
        "Радость",
        "Радость",
        "Восторг",
        "Надежда",
        "Гордость",
        "Восхищение",
        "Любовь",
        "Воодушевление",
        "Азарт",
        "Ликование",
        "Симпатия",
        "Предвкушение")

val pacification = arrayOf(
        "Умиротворение",
        "Умиротворение",
        "Умиление",
        "Безмятежность",
        "Воодушевление",
        "Нежность",
        "Благодарность")



